{
  "JS": "JavaScript (JS) — динамічна, об'єктно-орієнтована прототипна мова програмування. Реалізація стандарту ECMAScript. Найчастіше використовується для створення сценаріїв вебсторінок, що надає можливість на боці клієнта (пристрої кінцевого користувача) взаємодіяти з користувачем, керувати браузером, асинхронно обмінюватися даними з сервером, змінювати структуру та зовнішній вигляд вебсторінки.",
  "REACT_NATIVE": "React Native — це програма інтерфейсу користувача з відкритим вихідним кодом, створена Meta Platforms, Inc. Вона використовується для розробки програм для Android, Android TV, iOS, macOS, tvOS, Web, Windows і UWP, дозволяючи розробникам використовувати фреймворк React разом із можливості рідної платформи.",
  "SWIFT": "Swift — це універсальна компільована мова програмування з кількома парадигмами, розроблена Apple Inc. та спільнотою відкритих кодів.",
  "JAVA_KOTLIN": "Kotlin — статично типізована мова програмування, що працює поверх JVM і розробляється компанією JetBrains.\nJava — об'єктно-орієнтована мова програмування, випущена 1995 року компанією «Sun Microsystems» як основний компонент платформи Java. З 2009 року мовою займається компанія «Oracle», яка того року придбала «Sun Microsystems». В офіційній реалізації Java-програми компілюються у байт-код, який при виконанні інтерпретується віртуальною машиною для конкретної платформи.",
  "PHP": "PHP — скриптова мова програмування, була створена для генерації HTML-сторінок на стороні вебсервера. PHP є однією з найпоширеніших мов, що використовуються у сфері веброзробок. PHP підтримується переважною більшістю хостинг-провайдерів. PHP — проєкт відкритого програмного забезпечення.",
  "C++": "C++ — мова програмування загального призначення з підтримкою кількох парадигм програмування: об'єктно-орієнтованої, узагальненої, процедурної та ін.",
  "PYTHON": "Python — інтерпретована об'єктно-орієнтована мова програмування високого рівня зі строгою динамічною типізацією.",
  "JAVA": "Java — об'єктно-орієнтована мова програмування, випущена 1995 року компанією «Sun Microsystems» як основний компонент платформи Java. З 2009 року мовою займається компанія «Oracle», яка того року придбала «Sun Microsystems». В офіційній реалізації Java-програми компілюються у байт-код, який при виконанні інтерпретується віртуальною машиною для конкретної платформи.",
  "RUBY": "Ruby — це інтерпретована, повністю об'єктно-орієнтована мова програмування з чіткою динамічною типізацією. Мова вирізняється високою ефективністю розробки програм і увібрала в себе найкращі риси Perl, Java, Python, Smalltalk, Eiffel, Ada і Lisp."
}