{
  "JS": "JavaScript (JS) is a dynamic, object-oriented, prototypical programming language. An implementation of the ECMAScript standard. It is most often used to script web pages, which provides the ability on the client side (end-user device) to interact with the user, control the browser, exchange data asynchronously with the server, change the structure and appearance of the web page.",
  "REACT_NATIVE": "React Native is an open source user interface application developed by Meta Platforms, Inc. It is used to develop applications for Android, Android TV, iOS, macOS, tvOS, Web, Windows, and UWP, allowing developers to use the framework React along with native platform capabilities.",
  "SWIFT": "Swift is a universal, multi-paradigm compiled programming language developed by Apple Inc. and the open source community",
  "JAVA_KOTLIN": "Kotlin is a statically typed programming language that runs on top of the JVM and is developed by JetBrains.\nJava is an object-oriented programming language released in 1995 by Sun Microsystems as a core component of the Java platform. Since 2009, the language is engaged by the company \"Oracle\", which acquired \"Sun Microsystems\" that year. In the official implementation, Java programs are compiled into bytecode, which, when executed, is interpreted by a virtual machine for a specific platform.",
  "PHP": "PHP is a scripting programming language that was created to generate HTML pages on the web server side. PHP is one of the most common languages used in web development. PHP is supported by the vast majority of hosting providers. PHP is an open source project.",
  "C++": "C++ is a general-purpose programming language with support for several programming paradigms: object-oriented, generalized, procedural, etc",
  "PYTHON": "Python is an interpreted high-level object-oriented programming language with strict dynamic typing.",
  "JAVA": "Java is an object-oriented programming language released in 1995 by the Sun Microsystems company as the main component of the Java platform. Since 2009, the language has been developed by the Oracle company, which acquired Sun Microsystems that year. In the official implementations of Java programs are compiled into bytecode, which, when executed, is interpreted by a virtual machine for a specific platform",
  "RUBY": "Ruby is an interpreted, fully object-oriented programming language with strong dynamic typing. The language is highly efficient in program development and incorporates the best features of Perl, Java, Python, Smalltalk, Eiffel, Ada, and Lisp."
}